{"t": "config", "timeout_ms": 300000, "max_iterations": 10, "context_warn": 0.7, "context_compact": 0.85, "context_kill": 0.95}
{"t": "spec", "spec": "construct-mode.md"}
{"t": "task", "id": "t-t3yy", "spec": "construct-mode.md", "name": "Rename VERIFY stage to VALIDATE in code", "s": "p", "notes": "In powerplant/ralph line 631, get_stage() returns VERIFY but spec requires VALIDATE. Also update get_prompt_for_stage() (lines 3127-3128) and rename PROMPT_verify.md to PROMPT_validate.md. Check all usages of VERIFY string.", "accept": "grep -r VERIFY powerplant/ralph returns 0 matches, grep -r VALIDATE returns stage-related matches", "priority": "high"}
{"t": "task", "id": "t-0qgs", "spec": "construct-mode.md", "name": "Update shell completions for construct mode", "s": "p", "notes": "Files: powerplant/ralph-completion.zsh and ralph-completion.bash. (1) Replace build with construct as primary command. (2) Add construct to subcommands list. (3) Add missing task subcommands: reject, delete, prioritize (line 40 only has done/add/accept).", "accept": "Shell completions list construct as command and task subcommands include reject/delete/prioritize", "priority": "medium"}
{"t": "task", "id": "t-xzle", "spec": "construct-mode.md", "name": "Implement ralph query iteration command", "s": "p", "notes": "Spec line 588 requires ralph query iteration to return current iteration number. Currently iteration is only tracked at runtime in cmd_run() line 3286. Need to persist iteration count in state and expose via query subcommand at line 3773.", "accept": "ralph query iteration returns a number during construct mode execution", "priority": "medium"}
{"t": "task", "id": "t-1oyh", "spec": "construct-mode.md", "name": "Add per-task ID support to ralph task accept", "s": "p", "notes": "Current accept (lines 3858-3868) accepts ALL done tasks. Spec requires ralph task accept <id> to accept individual tasks. Modify to: if ID provided, accept only that task; if no ID, accept all (backward compatible).", "accept": "ralph task accept t-xxxx accepts only that task, ralph task accept still works for all", "priority": "medium"}
{"t": "task", "id": "t-9zz0", "spec": "construct-mode.md", "name": "Add per-task ID support to ralph task reject", "s": "p", "notes": "Current reject (lines 3870-3886) rejects only FIRST done task. Spec requires ralph task reject <id> \"reason\". Modify to require ID parameter. Syntax: ralph task reject t-xxxx \"reason\"", "accept": "ralph task reject t-xxxx \"reason\" rejects specified task with tombstone", "priority": "medium"}
{"t": "task", "id": "t-iuo2", "spec": "construct-mode.md", "name": "Implement context compaction logic", "s": "p", "notes": "Lines 3495-3521 is a stub that immediately fails. Implement actual compaction per spec lines 413-445: (1) Preserve: current task, edited files, uncommitted changes, key decisions. (2) Summarize: exploration results, tool outputs. (3) Discard: verbose output, processed contents. Output format in spec lines 436-444. Challenge: compaction requires LLM interaction mid-execution - may need architectural change.", "accept": "At 85% context, compaction is attempted with actual summarization logic before falling back to kill", "priority": "low"}
{"t": "task", "id": "t-u1tu", "spec": "construct-mode.md", "name": "Add critical path analysis to task prioritization", "s": "p", "notes": "Prioritize command (lines 3902-3965) counts direct blockers but spec line 616 requires critical path analysis. Add: compute longest path through dependency graph, tasks on critical path get higher priority. Currently missing from acceptance criteria line 714.", "accept": "ralph task prioritize considers longest dependency chain, not just direct blockers", "priority": "medium"}
{"t": "task", "id": "t-4oda", "spec": "construct-mode.md", "name": "Update VALIDATE prompt for fork/join parallel verification", "s": "p", "notes": "PROMPT_verify.md (to be renamed PROMPT_validate.md) should instruct parallel subagent spawning per spec lines 282-308. For each done task: spawn subagent with verification prompt, collect JSON verdict {task_id, verdict, reason, gaps}, then apply accepts/rejects in batch.", "accept": "PROMPT_validate.md explicitly instructs fork/join pattern with one subagent per done task", "deps": ["t-t3yy"], "priority": "medium"}
