{"t": "config", "timeout_ms": 300000, "max_iterations": 10, "context_warn": 0.7, "context_compact": 0.85, "context_kill": 0.95}
{"t": "spec", "spec": "construct-mode.md"}
{"t": "task", "id": "t-h0ff", "spec": "construct-mode.md", "name": "Implement true critical path analysis in prioritize", "s": "d", "notes": "Current implementation only counts direct blockers (blocking_count). Need to: 1) Build dependency DAG structure, 2) Calculate longest path to completion for each task, 3) Give higher priority to tasks on the critical path vs tasks with equal direct blockers but shorter chains. Location: powerplant/ralph lines 4034-4097.", "accept": "Tasks on longest dependency chain get higher priority than equal-blocking-count tasks off critical path. Test: Create 3 tasks where A->B->C and D->E (both B and D block 1 task), verify B gets higher priority than D due to longer chain.", "done_at": "256b91e", "priority": "medium"}
{"t": "task", "id": "t-goep", "spec": "construct-mode.md", "name": "Add individual task accept by ID", "s": "d", "notes": "Current ralph task accept accepts ALL done tasks at once. Need to support ralph task accept <task-id> to accept only that specific task. Required for VERIFY fork/join pattern where each subagent accepts only its assigned task. Location: powerplant/ralph lines 3983-3993.", "accept": "ralph task accept t-xxxx accepts only that specific task, leaving other done tasks unchanged", "done_at": "cc811a2", "priority": "medium"}
{"t": "task", "id": "t-02ib", "spec": "construct-mode.md", "name": "Implement priority inheritance from issue to task", "s": "p", "notes": "Issue dataclass has priority field (line 507) but tasks created from issues do not inherit it. Need: 1) task add command to extract priority from JSON, 2) INVESTIGATE prompt to include priority in task JSON, 3) Or automatic lookup of originating issue priority. Location: powerplant/ralph lines 3953-3976.", "accept": "Tasks created via ralph task add from INVESTIGATE stage inherit priority from the originating issue", "priority": "medium"}
{"t": "task", "id": "t-5ht9", "spec": "construct-mode.md", "name": "Implement actual context compaction logic", "s": "p", "notes": "Current compaction at 85% is a stub that immediately fails (lines 3611-3637). Need to implement actual compaction per spec: 1) Preserve: current task/edited files/uncommitted changes/recent errors/key decisions, 2) Summarize: exploration results/tool outputs/code reads, 3) Discard: verbose output/full file contents/redundant exploration, 4) Output COMPACTED CONTEXT format, 5) Resume if context < 70% after, else kill. May need architectural changes since current code cannot compact mid-execution.", "accept": "At 85% context, compaction produces summary, preserves key state, discards verbose output, and if context drops below 70% execution resumes", "priority": "low"}
{"t": "task", "id": "t-dg0k", "spec": "construct-mode.md", "name": "Add prioritize call at VERIFY stage completion", "s": "p", "notes": "Spec requires VERIFY stage calls prioritize at end before transitioning (line 713). Currently only calls prioritize on SPEC_INCOMPLETE. Need to call prioritize on all VERIFY completions before next iteration. Location: construct loop around lines 3767-3832.", "accept": "ralph task prioritize is called after VERIFY stage completes, before transitioning to next iteration", "priority": "medium"}
